;---------------------------------------------------------------------------------------
;	FILE:   FactionAnchor loco   CREATED BY RustyDios
;           
;	File created	04/02/21	15:15
;	LAST UPDATED    07/02/21	20:20
;
;	you should technically never see these ... but just in case... 
;
;---------------------------------------------------------------------------------------

[FactionAnchor X2AbilityTemplate]
LocFriendlyName="Faction Anchor"
LocHelpText="<font color = '#FA6942'>***** ERROR *****</font>\nYou should not be seeing this. This unit is designated as the 'faction anchor' and is both invisible and immune to all damage.\nIt will die through code when all other units are dead. \n~Thanks to RustyDios for the system!"
LocLongDescription="<font color = '#FA6942'>***** ERROR *****</font>\nYou should not be seeing this. This unit is designated as the 'faction anchor' and is both invisible and immune to all damage.\nIt will die through code when all other units are dead. \n~Thanks to RustyDios for the system!"
LocFlyOverText=""

[FA_Debug_Show X2AbilityTemplate]
LocFriendlyName="(DEBUG) Reveal"
LocHelpText="<font color = '#FA6942'>***** DEBUG *****</font>\nYou should not be seeing this.\nThis is a fallback debug 2-step proccess to 'raise' the anchor.\nFirst use this reveal, then KILL the Anchor"
LocLongDescription="<font color = '#FA6942'>***** DEBUG *****</font>\nYou should not be seeing this.\nThis is a fallback debug 2-step proccess to 'raise' the anchor.\nFirst use this reveal, then KILL the Anchor"
LocFlyOverText=""

[FA_Debug_Kill X2AbilityTemplate]
LocFriendlyName="(DEBUG) Kill"
LocHelpText="<font color = '#FA6942'>***** DEBUG *****</font>\nYou should not be seeing this.\nThis is a fallback debug 2-step proccess to 'raise' the anchor.\nSecondly spam this to KILL the anchor."
LocLongDescription="<font color = '#FA6942'>***** DEBUG *****</font>\nYou should not be seeing this.\nThis is a fallback debug 2-step proccess to 'raise' the anchor.\nSecondly spam this to KILL the anchor."
LocFlyOverText=""

[FactionAnchorMX X2CharacterTemplate]
strCharacterName="Faction Anchor"
strAcquiredText="YAF1 and X2AllowSelectAll have let you view the 'debug menu' for this unit. Please move on..."
